app/controllers/containers_controller.rb

SELECT "containers".* FROM "containers"
SELECT 1 AS one FROM "containers" LIMIT ?  [["LIMIT", 1]]
---
  def index
    container = Container.all
    if container.empty?

SELECT "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "containers" ("name", "image", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "Container_2"], ["image", "windows"], ["status", "active"], ["created_at", "2025-02-22 00:28:18.508964"], ["updated_at", "2025-02-22 00:28:18.508964"]]
INSERT INTO "containers" ("name", "image", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "Container_3"], ["image", "ubuntu"], ["status", "inactive"], ["created_at", "2025-02-22 17:42:03.797561"], ["updated_at", "2025-02-22 17:42:03.797561"]]
---
  def create
    image = Image.find(params[:image_id])
    container = Container.create_docker_container(params[:name], image.name)
    @container = Container.create(
    name: params[:name],
    image: image,
    docker_id: container.id,
    status: 'stopped')

DELETE FROM "containers" WHERE "containers"."id" = ?  [["id", 13]]
---
  def destroy
    Container.delete_container(@container, @container.docker_id)

SELECT "containers".* FROM "containers" WHERE "containers"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
  def set_container
    @container = Container.find(params[:id])