app/controllers/containers_controller.rb

  def update

    if @container.update(container_params)
---
UPDATE "containers" SET "status" = ?, "updated_at" = ? WHERE "containers"."id" = ?  [["status", "start"], ["updated_at", "2025-02-23 15:00:10.212496"], ["id", 10]]

  def destroy
    if @container
      @docker_container.delete(:force => true)
---
DELETE FROM "containers" WHERE "containers"."id" = ?  [["id", 10]]

  def set_container
    @container = Container.find(params[:id])
---
SELECT "containers".* FROM "containers" WHERE "containers"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]