app/controllers/containers_controller.rb

SELECT "containers".* FROM "containers" WHERE "containers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_container
    @container = Container.find(params[:id])