app/controllers/images_controller.rb

SELECT "images".* FROM "images"
SELECT 1 AS one FROM "images" LIMIT ?  [["LIMIT", 1]]
---
  def index
    images = Image.all
    if images.empty?