app/models/container.rb

class Container < ApplicationRecord
  validates :docker_id, presence: true, uniqueness: true
  validates :image, presence: true
  validates :image_id, presence: true, inclusion: {in: Image.pluck(:id)} #Assure that the container will only be created with an image saved in the DB
---
SELECT "images"."id" FROM "images"

  def self.change_status(container, docker_id, status)
    return { error: "Container not found!", status: 404 } unless container
    if status == "Start"
      if check_container_status(container)
        return  {error: "This container is already running!", status: 400}
      else
        docker_container = Docker::Container.get(docker_id)
        docker_container.start
        container[:status] = "Running"
        container.save!
        return  {container: container, status: 200}
      end
    elsif status == "Stop"
      if check_container_status(container)
        docker_container = Docker::Container.get(docker_id)
        docker_container.stop
        container[:status] = "Stopped"
        container.save!
---
UPDATE "containers" SET "status" = ?, "updated_at" = ? WHERE "containers"."id" = ?  [["status", "Running"], ["updated_at", "2025-03-08 23:36:29.461007"], ["id", 11]]
UPDATE "containers" SET "status" = ?, "updated_at" = ? WHERE "containers"."id" = ?  [["status", "Stopped"], ["updated_at", "2025-03-08 23:41:38.478688"], ["id", 11]]

  def self.delete_container(container, docker_id)
    docker_container = Docker::Container.get(docker_id)
    docker_container.delete(:force => true)
    container.destroy
---
DELETE FROM "containers" WHERE "containers"."id" = ?  [["id", 24]]